tap "adoptopenjdk/openjdk"
tap "atomicjar/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "mongodb/brew"

# Cross-platform make
brew "cmake"

# GNU Transport Layer Security (TLS) Library
brew "gnutls"

# Library access to GnuPG
brew "gpgme"

# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"

# GNOME document viewer
brew "evince"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Development kit for the Java programming language
brew "openjdk"

# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"

# Java servlet engine and webserver
brew "jetty"

# Clone of ls with colorful output, file type icons, and more
brew "lsd"

# Text-based web browser
brew "lynx"

# Java-based project management
brew "maven"

# Platform built on V8 to build network applications
brew "node"

# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"

# Open source relational database management system
brew "mysql", restart_service: true

# Open source relational database management system
brew "mysql@8.0"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Command-line interface for SQLite
brew "sqlite"

# Interpreted, interactive, object-oriented programming language
brew "python@3.10"

# Platform built on V8 to build network applications
brew "node@14"

# Platform built on V8 to build network applications
brew "node@16"

# Development kit for the Java programming language
brew "openjdk@8"

# Swiss-army knife of markup format conversion
brew "pandoc"

# Interpreted, interactive, object-oriented programming language
brew "python@3.11"

# Interpreted, interactive, object-oriented programming language
brew "python@3.12"

# Graphical command-line client for SSH
brew "sshs"

# Terminal multiplexer
brew "tmux"

# Vi 'workalike' with many additional features
brew "vim"

# JavaScript package manager
brew "yarn"
brew "hudochenkov/sshpass/sshpass"

# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@6.0"

# GPU-accelerated terminal emulator
cask "alacritty"

# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "gulp"

# GPU-based terminal emulator
cask "kitty"

# Tescontainers desktop application for local testing and development
cask "testcontainers-desktop"

# HTML to PDF renderer
cask "wkhtmltopdf"
